gitarmpit/libarmpit/lib/stm32_common/timer.cpp
#include "timer_cpp.h"

#ifndef TIMER_INTERRUPTS_OFF

#ifdef __cplusplus
extern "C"
{
#endif

    
#if defined(VALUE_LINE)
void TIM1_BRK_TIM15_IRQHandler(void)
{
    TIM15::GetInstance()->HandleInterrupt();
}

void TIM1_UP_TIM16_IRQHandler(void)
{
    if (TIM1::GetInstance()->IsUIF())
    {
        TIM1::GetInstance()->HandleInterrupt();
    }
    else
    {
        TIM16::GetInstance()->HandleInterrupt();
    }
}

void TIM1_TRG_COM_TIM17_IRQHandler(void)
{
    TIM17::GetInstance()->HandleInterrupt();
}


#elif defined(STM32F2) || defined(STM32F4) || defined(STM32F10X_XL)


void TIM1_BRK_TIM9_IRQHandler(void)
{
    TIM9::GetInstance()->HandleInterrupt();
}
void TIM1_UP_TIM10_IRQHandler(void)
{
    if (TIM1::GetInstance()->IsUIF())
    {
        TIM1::GetInstance()->HandleInterrupt();
    }
    else
    {
        TIM10::GetInstance()->HandleInterrupt();
    }
}
void TIM1_TRG_COM_TIM11_IRQHandler(void)
{
    TIM11::GetInstance()->HandleInterrupt();
}
#else

void TIM1_BRK_IRQHandler(void)
{
}

void TIM1_UP_IRQHandler(void)
{
    TIM1::GetInstance()->HandleInterrupt();
}

void TIM1_TRG_COM_IRQHandler(void)
{
}

#endif

void TIM1_CC_IRQHandler(void)
{
}



void TIM2_IRQHandler(void)
{
    TIM2::GetInstance()->HandleInterrupt();
}

void TIM3_IRQHandler(void)
{
    TIM3::GetInstance()->HandleInterrupt();
}

#if !defined(STM32F10X_LD) && !defined(STM32F10X_LD_VL)
void TIM4_IRQHandler(void)
{
    TIM4::GetInstance()->HandleInterrupt();
}
#endif

#if defined(STM32F2) || defined(STM32F4) || defined(STM32F10X_HD) || defined(STM32F10X_HD_VL) || defined(STM32F10X_XL) || defined(STM32F10X_CL)
void TIM5_IRQHandler(void)
{
    TIM5::GetInstance()->HandleInterrupt();
}
#endif


#if defined(STM32F2) || \
(defined(STM32F4) && !defined(STM32F401xC)  && !defined(STM32F401xE) && !defined(STM32F401xx) && !defined(STM32F411xE)) ||\
defined(VALUE_LINE)
void TIM6_DAC_IRQHandler(void)
{
    if (TIM6::GetInstance()->IsUIF())
    {
        TIM6::GetInstance()->HandleInterrupt();
    }
}
#endif

#if (defined(STM32F10X_HD)  || defined(STM32F10X_XL) || defined(STM32F10X_CL)) || defined(STM32F4)
void TIM6_IRQHandler(void)
{
    TIM6::GetInstance()->HandleInterrupt();
}
void TIM7_IRQHandler(void)
{
    TIM7::GetInstance()->HandleInterrupt();
}
#endif



#if defined(STM32F10X_HD_VL)
void TIM12_IRQHandler(void)
{
    TIM12::GetInstance()->HandleInterrupt();
}
void TIM13_IRQHandler(void)
{
    TIM13::GetInstance()->HandleInterrupt();
}
void TIM14_IRQHandler(void)
{
    TIM14::GetInstance()->HandleInterrupt();
}

#elif (defined(STM32F10X_XL) || defined(STM32F2) || defined(STM32F4)) \
&& (!defined(STM32F401xC)  && !defined(STM32F401xE) && !defined(STM32F401xx) && !defined(STM32F411xE))

void TIM8_BRK_TIM12_IRQHandler(void)
{
    TIM12::GetInstance()->HandleInterrupt();
}
void TIM8_UP_TIM13_IRQHandler(void)
{
    if (TIM8::GetInstance()->IsUIF())
    {
        TIM8::GetInstance()->HandleInterrupt();
    }
    else
    {
        TIM13::GetInstance()->HandleInterrupt();
    }
}
void TIM8_TRG_COM_TIM14_IRQHandler(void)
{
    TIM14::GetInstance()->HandleInterrupt();
}

#endif


#if (defined(STM32F2) || defined(STM32F4) || defined(STM32F10X_HD)) \
&& (!defined(STM32F401xC)  && !defined(STM32F401xE) && !defined(STM32F401xx) && !defined(STM32F411xE))
void TIM8_BRK_IRQHandler(void)
{
}
void TIM8_UP_IRQHandler(void)
{
    TIM8::GetInstance()->HandleInterrupt();
}
void TIM8_TRG_COM_IRQHandler(void)
{
}
#endif

void TIM8_CC_IRQHandler(void)
{
}


#if defined(STM32L0)

void TIM21_IRQHandler(void)
{
    TIM21::GetInstance()->HandleInterrupt();
}

void TIM22_IRQHandler(void)
{
    TIM22::GetInstance()->HandleInterrupt();
}
#endif


#ifdef __cplusplus
}
#endif

#endif

void TIMER::HandleInterrupt()
{
    if (IsUIF())
    {
        ClearUIF();
        for (uint8_t i = 0; i < _irqHandlerCount; ++i)
        {
            _irqHandlers[i]->HandleInterrupt(true, false);
        }
    }
}

void TIMER_With_Channels::HandleInterrupt()
{
    bool isUIF = IsUIF();
    bool isTIF = IsTIF();
    if (isUIF || isTIF)
    {
        if (isUIF)
            ClearUIF();
        if (isTIF)
            ClearTIF();

        for (uint8_t i = 0; i < _irqHandlerCount; ++i)
        {
            _irqHandlers[i]->HandleInterrupt(true, false);
        }
    }
    
    for (uint8_t i = 0; i < _nchannels; ++i)
    {
        if (_channels[i].IsCCFlag())
        {
            _channels[i].ClearCCFlag();
            if (_channels[i]._ccHandler)
                _channels[i]._ccHandler->HandleInterrupt(&_channels[i]);
        }
    }

}

void TIMER_With_SlaveMode::HandleInterrupt()
{
    bool isUIF = IsUIF();
    bool isTIF = IsTIF();
    if (isUIF || isTIF)
    {
        if (isUIF)
            ClearUIF();
        if (isTIF)
            ClearTIF();

        for (uint8_t i = 0; i < _irqHandlerCount; ++i)
        {
            _irqHandlers[i]->HandleInterrupt(true, false);
        }
    }

    for (uint8_t i = 0; i < _nchannels; ++i)
    {
        if (_channels[i].IsCCFlag())
        {
            _channels[i].ClearCCFlag();
            if (i == 0 && _pwmCaptureHandler)
            {
                uint16_t period = _channels[0].GetCCR();
                uint16_t duty   = _channels[1].GetCCR();

                uint32_t timClk = RCC_GetTIMx_CLK(_isAPB1);
                volatile uint32_t period_us = (uint64_t)period * 1000000llu * (uint64_t)(*_psc + 1) / timClk;
                volatile uint32_t duty_us = (uint64_t)duty * 1000000llu * (uint64_t)(*_psc + 1) / timClk;
                _pwmCaptureHandler->Handle(period_us, duty_us);
            }
            else if (_channels[i]._ccHandler)
            {
                _channels[i]._ccHandler->HandleInterrupt(&_channels[i]);
            }
        }
    }

}


TIMER_With_OnePulseMode::TIMER_With_OnePulseMode (uint32_t timx_base_addr)
{
    _cr1 = (volatile uint32_t*)(timx_base_addr + TIM_CR1_OFFSET);
}

void TIMER_With_OnePulseMode::EnableOnePulseMode (bool enable)
{
    if (enable)
        *_cr1 |= TIM_CR1_OPM;
    else
        *_cr1 &= ~TIM_CR1_OPM;
}


TIMER_With_UpDownCounter::TIMER_With_UpDownCounter (uint32_t timx_base_addr)
{
    _cr1 = (volatile uint32_t*)(timx_base_addr + TIM_CR1_OFFSET);
}
void TIMER_With_UpDownCounter::SetCenterAlignedModeOFF()
{
    *_cr1 &= ~TIM_CR1_CMS_CLEARMASK;
    *_cr1 |= TIM_CR1_CMS_EDGE_ALIGNED;
}
void TIMER_With_UpDownCounter::SetCenterAlignedModeFlagOnUp()
{
    *_cr1 &= ~TIM_CR1_CMS_CLEARMASK;
    *_cr1 |= TIM_CR1_CMS_CENTER_ALIGNED_UP;
}
void TIMER_With_UpDownCounter::SetCenterAlignedModeFlagOnDown()
{
    *_cr1 &= ~TIM_CR1_CMS_CLEARMASK;
    *_cr1 |= TIM_CR1_CMS_CENTER_ALIGNED_DOWN;
}
void TIMER_With_UpDownCounter::SetCenterAlignedModeFlagOnUpDown()
{
    *_cr1 &= ~TIM_CR1_CMS_CLEARMASK;
    *_cr1 |= TIM_CR1_CMS_CENTER_ALIGNED_UP_DOWN;
}
void TIMER_With_UpDownCounter::SetDirectionUp()
{
    *_cr1 &= ~TIM_CR1_DIR;
}
void TIMER_With_UpDownCounter::SetDirectionDown()
{
    *_cr1 |= TIM_CR1_DIR;
}


TIMER_With_DMAControl::TIMER_With_DMAControl(uint32_t timx_base_addr)
{
    _dcr = (volatile uint32_t*)(timx_base_addr + TIM_DCR_OFFSET);
    _dmar = (volatile uint32_t*)(timx_base_addr + TIM_DMAR_OFFSET);
    _cr2 = (volatile uint32_t*)(timx_base_addr + TIM_CR2_OFFSET);
    _dier = (volatile uint32_t*)(timx_base_addr + TIM_DIER_OFFSET);
}

void TIMER_With_DMAControl::SetDMABaseAddress (uint16_t addr)
{
    *_dcr |=  (addr & 0x1f)<< TIM_DCR_DBA_OFFSET;
}
void TIMER_With_DMAControl::SetDMABurstLength (uint16_t length)
{
    *_dcr |=  (length & 0x1f)<< TIM_DCR_DBL_OFFSET;
}
void TIMER_With_DMAControl::SetDMAAddressFullTransfer (uint16_t addr)
{
    *_dmar = addr;
}


void TIMER_With_DMAControl::SendDMARequestOnCCEvent()
{
    *_cr2 &= ~TIM_CR2_CCDS;
}
void TIMER_With_DMAControl::SendDMARequestOnUpdateEvent()
{
    *_cr2 |= TIM_CR2_CCDS;
}

void TIMER_With_DMAControl::EnableUpdateDMARequest(bool enable)
{
    if (enable)
        *_dier |= TIM_DIER_UDE;
    else
        *_dier &= ~TIM_DIER_UDE;

