gitarmpit/libarmpit/lib/stm32_common/timer.cpp
}
void TIMER_With_DMAControl::EnableTriggerDMARequest(bool enable)
{
    if (enable)
        *_dier |= TIM_DIER_TDE;
    else
        *_dier &= ~TIM_DIER_TDE;
}



TIMER_With_MMS::TIMER_With_MMS(uint32_t timx_base_addr)
{
    _cr2 = (volatile uint32_t*)(timx_base_addr + TIM_CR2_OFFSET);
}
void TIMER_With_MMS::SetMMS_Reset()
{
    *_cr2 &= ~TIM_CR2_MMS_CLEARMASK;
    *_cr2 |= TIM_CR2_MMS_RESET;
}
void TIMER_With_MMS::SetMMS_Enable()
{
    *_cr2 &= ~TIM_CR2_MMS_CLEARMASK;
    *_cr2 |= TIM_CR2_MMS_ENABLE;
}
void TIMER_With_MMS::SetMMS_Update()
{
    *_cr2 &= ~TIM_CR2_MMS_CLEARMASK;
    *_cr2 |= TIM_CR2_MMS_UPDATE;
}
void TIMER_With_MMS::SetMMS_Compare_Pulse()
{
    *_cr2 &= ~TIM_CR2_MMS_CLEARMASK;
    *_cr2 |= TIM_CR2_MMS_COMPARE_PULSE;
}
void TIMER_With_MMS::SetMMS_Compare_OC1REF()
{
    *_cr2 &= ~TIM_CR2_MMS_CLEARMASK;
    *_cr2 |= TIM_CR2_MMS_COMPARE_OC1REF;
}
void TIMER_With_MMS::SetMMS_Compare_OC2REF()
{
    *_cr2 &= ~TIM_CR2_MMS_CLEARMASK;
    *_cr2 |= TIM_CR2_MMS_COMPARE_OC2REF;
}
void TIMER_With_MMS::SetMMS_Compare_OC3REF()
{
    *_cr2 &= ~TIM_CR2_MMS_CLEARMASK;
    *_cr2 |= TIM_CR2_MMS_COMPARE_OC3REF;
}
void TIMER_With_MMS::SetMMS_Compare_OC4REF()
{
    *_cr2 &= ~TIM_CR2_MMS_CLEARMASK;
    *_cr2 |= TIM_CR2_MMS_COMPARE_OC4REF;
}



TIMER_With_SlaveMode::TIMER_With_SlaveMode(uint32_t timx_base_addr, uint8_t nchannels, IRQn_Type irqNo,
        volatile uint32_t* rccEnableReg,  volatile uint32_t* rccResetReg, uint32_t rccBit, bool isAPB1)
: TIMER_With_Channels (timx_base_addr, nchannels, irqNo, rccEnableReg, rccResetReg, rccBit, isAPB1)
{
    _smcr = (volatile uint32_t*)(timx_base_addr + TIM_SMCR_OFFSET);
    _pwmCaptureHandler = 0;
}

void TIMER_With_SlaveMode::SetSlaveMode_Disabled()
{
    *_smcr &= ~TIM_SMCR_SMS_CLEARMASK;
    *_smcr |= TIM_SMCR_SMS_OFF;
}
void TIMER_With_SlaveMode::SetSlaveMode_Encoder1()
{
    *_smcr &= ~TIM_SMCR_SMS_CLEARMASK;
    *_smcr |= TIM_SMCR_SMS_ENC1;
}
void TIMER_With_SlaveMode::SetSlaveMode_Encoder2()
{
    *_smcr &= ~TIM_SMCR_SMS_CLEARMASK;
    *_smcr |= TIM_SMCR_SMS_ENC2;
}
void TIMER_With_SlaveMode::SetSlaveMode_Encoder3()
{
    *_smcr &= ~TIM_SMCR_SMS_CLEARMASK;
    *_smcr |= TIM_SMCR_SMS_ENC3;
}
void TIMER_With_SlaveMode::SetSlaveMode_Reset()
{
    *_smcr &= ~TIM_SMCR_SMS_CLEARMASK;
    *_smcr |= TIM_SMCR_SMS_RESET;
}
void TIMER_With_SlaveMode::SetSlaveMode_Gated()
{
    *_smcr &= ~TIM_SMCR_SMS_CLEARMASK;
    *_smcr |= TIM_SMCR_SMS_GATED;
}
void TIMER_With_SlaveMode::SetSlaveMode_Trigger()
{
    *_smcr &= ~TIM_SMCR_SMS_CLEARMASK;
    *_smcr |= TIM_SMCR_SMS_TRIGGER;
}
void TIMER_With_SlaveMode::SetSlaveMode_ExternalClock()
{
    *_smcr &= ~TIM_SMCR_SMS_CLEARMASK;
    *_smcr |= TIM_SMCR_SMS_EXT;
}

void TIMER_With_SlaveMode::SetSlaveModeTrigger_ITR0()
{
    *_smcr &= ~TIM_SMCR_TS_CLEARMASK;
    *_smcr |= TIM_SMCR_TS_ITR0;
}
void TIMER_With_SlaveMode::SetSlaveModeTrigger_ITR1()
{
    *_smcr &= ~TIM_SMCR_TS_CLEARMASK;
    *_smcr |= TIM_SMCR_TS_ITR1;
}
void TIMER_With_SlaveMode::SetSlaveModeTrigger_ITR2()
{
    *_smcr &= ~TIM_SMCR_TS_CLEARMASK;
    *_smcr |= TIM_SMCR_TS_ITR2;
}
void TIMER_With_SlaveMode::SetSlaveModeTrigger_ITR3()
{
    *_smcr &= ~TIM_SMCR_TS_CLEARMASK;
    *_smcr |= TIM_SMCR_TS_ITR3;
}
void TIMER_With_SlaveMode::SetSlaveModeTrigger_TI1F_ED()
{
    *_smcr &= ~TIM_SMCR_TS_CLEARMASK;
    *_smcr |= TIM_SMCR_TS_TI1F_ED;
}
void TIMER_With_SlaveMode::SetSlaveModeTrigger_TI1FP1()
{
    *_smcr &= ~TIM_SMCR_TS_CLEARMASK;
    *_smcr |= TIM_SMCR_TS_TI1FP1;
}
void TIMER_With_SlaveMode::SetSlaveModeTrigger_TI1FP2()
{
    *_smcr &= ~TIM_SMCR_TS_CLEARMASK;
    *_smcr |= TIM_SMCR_TS_TI1FP2;
}
void TIMER_With_SlaveMode::SetSlaveModeTrigger_ETRF()
{
    *_smcr &= ~TIM_SMCR_TS_CLEARMASK;
    *_smcr |= TIM_SMCR_TS_ETRF;
}


void TIMER_With_SlaveMode::EnableMasterSlaveMode(bool enable)
{
    if (enable)
        *_smcr |= TIM_SMCR_MSM;
    else
        *_smcr &= ~TIM_SMCR_MSM;
}


void TIMER_Channel::EnableCCInterrupt (bool enable, TIMER_Channel_CCInterrupt_Handler* handler)
{
    if (enable)
    {
        *_dier |= _dier_CCxIE;
        _ccHandler = handler;
    }
    else
        *_dier &= ~_dier_CCxIE;
}

void TIMER_Channel::EnableCCDMARequest (bool enable)
{
    if (enable)
        *_dier |= _dier_CCxDE;
    else
        *_dier &= ~_dier_CCxDE;
}

bool TIMER_Channel::IsCCFlag()
{
    return *_sr & _sr_CCxIF;
}
void TIMER_Channel::ClearCCFlag()
{
    *_sr &= ~_sr_CCxIF;
}

bool TIMER_Channel::IsOCFlag()
{
    return *_sr & _sr_CCxOF;
}
void TIMER_Channel::ClearOCFlag()
{
    *_sr &= ~_sr_CCxOF;
}

void TIMER_Channel::GenerateCCEvent(bool enable)
{
    if (enable)
        *_egr |= _egr_CCxG;
    else
        *_egr &= ~_egr_CCxG;
}


void TIMER_Channel::SetModeOutput()
{
    *_ccmr &= ~(TIM_CCMR1_CC1S_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_CC1S_OUT << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetModeInputDirect()
{
    *_ccmr &= ~(TIM_CCMR1_CC1S_CLEARMASK << (_channelNo-1)%2*8);

    *_ccmr |= (TIM_CCMR1_CC1S_IN_TI1 << (_channelNo-1)%2*8);

}

void TIMER_Channel::SetModeInputInverse()
{
    *_ccmr &= ~(TIM_CCMR1_CC1S_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_CC1S_IN_TI2 << (_channelNo-1)%2*8);
}
void TIMER_Channel::EnableFastMode (bool enable)
{
    if (enable)
        *_ccmr |= (TIM_CCMR1_OC1FE << (_channelNo-1)%2*8);
    else
        *_ccmr &= (~TIM_CCMR1_OC1FE << (_channelNo-1)%2*8);

}
void TIMER_Channel::EnableOCPreload (bool enable)
{
    if (enable)
        *_ccmr |= (TIM_CCMR1_OC1PE << (_channelNo-1)%2*8);
    else
        *_ccmr &= ~(TIM_CCMR1_OC1PE << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetOCMode_Frozen()
{
    *_ccmr &= ~(TIM_CCMR1_OC1M_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_OC1M_FROZEN << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetOCMode_HighOnMatch()
{
    *_ccmr &= ~(TIM_CCMR1_OC1M_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_OC1M_ACTIVE_ON_MATCH << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetOCMode_LowOnMatch()
{
    *_ccmr &= ~(TIM_CCMR1_OC1M_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_OC1M_INACTIVE_ON_MATCH << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetOCMode_ToggleOnMatch()
{
    *_ccmr &= ~(TIM_CCMR1_OC1M_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_OC1M_TOGGLE << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetOCMode_ForceLow()
{
    *_ccmr &= ~(TIM_CCMR1_OC1M_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_OC1M_FORCE_LOW << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetOCMode_ForceHigh()
{
    *_ccmr &= ~(TIM_CCMR1_OC1M_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_OC1M_FORCE_HIGH << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetOCMode_PWM1()
{
    *_ccmr &= ~(TIM_CCMR1_OC1M_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_OC1M_PWM1 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetOCMode_PWM2()
{
    *_ccmr &= ~(TIM_CCMR1_OC1M_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_OC1M_PWM2 << (_channelNo-1)%2*8);
}

void TIMER_Channel::EnableClearOnETRF (bool enable)
{
    if (enable)
        *_ccmr |= (TIM_CCMR1_OC1CE << (_channelNo-1)%2*8);
    else
        *_ccmr &= (~TIM_CCMR1_OC1CE << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICPrescaler_None()
{
    *_ccmr &= ~(TIM_CCMR1_IC1PSC_CLEARMASK << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICPrescaler_2()
{
    *_ccmr &= ~(TIM_CCMR1_IC1PSC_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1PSC_DIV2 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICPrescaler_4()
{
    *_ccmr &= ~(TIM_CCMR1_IC1PSC_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1PSC_DIV4 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICPrescaler_8()
{
    *_ccmr &= ~(TIM_CCMR1_IC1PSC_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1PSC_DIV8 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_None()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_CK_N2()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FCK_INT_2 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_CK_N4()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FCK_INT_4 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_CK_N8()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FCK_INT_8 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV2_N6()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_2_6 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV2_N8()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_2_8 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV4_N6()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_4_6 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV4_N8()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_4_8 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV8_N6()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_8_6 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV8_N8()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_8_8 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV16_N5()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_16_5 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV16_N6()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_16_6 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV16_N8()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_16_8 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV32_N5()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_32_5 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV32_N6()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_32_6 << (_channelNo-1)%2*8);
}
void TIMER_Channel::SetICFilter_DTS_DIV32_N8()
{
    *_ccmr &= ~(TIM_CCMR1_IC1F_CLEARMASK << (_channelNo-1)%2*8);
    *_ccmr |= (TIM_CCMR1_IC1F_FDTS_32_8 << (_channelNo-1)%2*8);
}

