gitarmpit/libarmpit/lib/stm32_common/timer.cpp
void TIMER_Channel::EnableChannel (bool enable)
{
    if (enable)
        *_ccer |= (TIM_CCER_CC1E<<(_channelNo-1)*4);
    else
        *_ccer &= ~(TIM_CCER_CC1E<<(_channelNo-1)*4);

}
void TIMER_Channel::SetOCCPolarityLow (bool set)
{
    if (set)
        *_ccer |= (TIM_CCER_CC1P<<(_channelNo-1)*4);
    else
        *_ccer &= ~(TIM_CCER_CC1P<<(_channelNo-1)*4);

}

void TIMER_Channel::SetICCRisingEdge ()
{
    *_ccer &= ~(TIM_CCER_CC1P<<(_channelNo-1)*4);
}
void TIMER_Channel::SetICCFallingEdge ()
{
    *_ccer |= (TIM_CCER_CC1P<<(_channelNo-1)*4);
}

#ifdef STM32F4
void TIMER_Channel::SetICCBothEdges ()
{
    *_ccer |= (TIM_CCER_CC1P<<(_channelNo-1)*4);
    *_ccer |= (TIM_CCER_CC1NP<<(_channelNo-1)*4);

}
#endif



void TIMER_Channel::SetCCR (uint16_t val)
{
    *_ccr = val;
}

uint16_t TIMER_Channel::GetCCR()
{
    return *_ccr;
}



TIMER::TIMER (uint32_t timx_base_addr, IRQn_Type irqNo, volatile uint32_t* rccEnableReg,
              volatile uint32_t* rccResetReg, uint32_t rccBit, bool isAPB1)
: Peripheral (rccEnableReg, rccResetReg, rccBit)
{
    _globalInterrupt = irqNo;
    _isAPB1 = isAPB1;

    _cr1 = (volatile uint32_t*)(timx_base_addr + TIM_CR1_OFFSET);
    //_cr2 = (volatile uint32_t*)(timx_base_addr + TIM_CR2_OFFSET);
    _dier = (volatile uint32_t*)(timx_base_addr + TIM_DIER_OFFSET);
    _sr = (volatile uint32_t*)(timx_base_addr + TIM_SR_OFFSET);
    _egr = (volatile uint32_t*)(timx_base_addr + TIM_EGR_OFFSET);
    _cnt = (volatile uint32_t*)(timx_base_addr + TIM_CNT_OFFSET);
    _psc = (volatile uint32_t*)(timx_base_addr + TIM_PSC_OFFSET);
    _arr = (volatile uint32_t*)(timx_base_addr + TIM_ARR_OFFSET);
    _irqHandlerCount = 0;
    _is32_bit = false;
}

TIMER* TIMER::Get_Instance(TIMER_Number timer_no)
{
    switch (timer_no)
    {
        case TIM1:
            return TIM1::GetInstance();
        case TIM2:
            return TIM2::GetInstance();
        case TIM3:
            return TIM3::GetInstance();

#if !defined(STM32F10X_LD) && !defined(STM32F10X_LD_VL)
        case TIM4:
            return TIM4::GetInstance();
#endif
#if defined(STM32F4) || defined(STM32F2) || defined(STM32F10X_HD) || defined(STM32F10X_HD_VL) || defined(STM32F10X_XL) || defined(STM32F10X_CL)
        case TIM5:
            return TIM5::GetInstance();
#endif

#if defined(VALUE_LINE) || defined(STM32F10X_HD)  || defined(STM32F10X_XL) || defined(STM32F10X_CL) \
|| defined(STM32F2) || defined(STM32F4) \
&& (!defined(STM32F401xC)  && !defined(STM32F401xE) && !defined(STM32F401xx) && !defined(STM32F411xE))
        case TIM6:
            return TIM6::GetInstance();
        case TIM7:
            return TIM7::GetInstance();
#endif

#if (defined(STM32F10X_XL) || defined(STM32F10X_HD) || defined(STM32F2) || defined(STM32F4)) \
&& (!defined(STM32F401xC)  && !defined(STM32F401xE) && !defined(STM32F401xx) && !defined(STM32F411xE))
        case TIM8:
            return TIM8::GetInstance();
#endif

#if defined(STM32F2) || defined(STM32F4) || defined(STM32F10X_XL)
            case TIM9:
            return TIM9::GetInstance();
        case TIM10:
            return TIM10::GetInstance();
        case TIM11:
            return TIM11::GetInstance();
#endif

#if (defined(STM32F10X_HD_VL) || defined(STM32F10X_XL) || defined(STM32F2) || defined(STM32F4) \
&& !defined(STM32F401xC)  && !defined(STM32F401xE) && !defined(STM32F401xx) && !defined(STM32F411xE))
        case TIM12:
            return TIM12::GetInstance();
        case TIM13:
            return TIM13::GetInstance();
        case TIM14:
            return TIM14::GetInstance();
#endif

#if defined(VALUE_LINE)
        case TIM15:
            return TIM15::GetInstance();
        case TIM16:
            return TIM16::GetInstance();
        case TIM17:
            return TIM17::GetInstance();
#endif

#if defined(STM32L0)
        case TIM21:
            return TIM21::GetInstance();
        case TIM22:
            return TIM22::GetInstance();
#endif
    };

    return 0;
}


TIMER_With_Channels::TIMER_With_Channels(uint32_t timx_base_addr, uint8_t nchannels, IRQn_Type irqNo,
        volatile uint32_t* rccEnableReg,  volatile uint32_t* rccResetReg, uint32_t rccBit, bool isAPB1) :
TIMER (timx_base_addr, irqNo, rccEnableReg, rccResetReg, rccBit, isAPB1)
{
    _nchannels = nchannels;


    for (uint8_t ch = 0; ch < nchannels; ++ch)
    {
        _channels[ch]._channelNo = ch + 1;
        _channels[ch]._timer = this;
        _channels[ch]._dier = (volatile uint32_t*)(timx_base_addr + TIM_DIER_OFFSET);
        _channels[ch]._sr = (volatile uint32_t*)(timx_base_addr + TIM_SR_OFFSET);
        _channels[ch]._egr = (volatile uint32_t*)(timx_base_addr + TIM_EGR_OFFSET);
        _channels[ch]._bdtr = 0;

        if (ch < 2)
        {
            _channels[ch]._ccmr = (volatile uint32_t*)(timx_base_addr + TIM_CCMR1_OFFSET);
        }
        else
        {
            _channels[ch]._ccmr = (volatile uint32_t*)(timx_base_addr + TIM_CCMR2_OFFSET);
        }

        _channels[ch]._ccer = (volatile uint32_t*)(timx_base_addr + TIM_CCER_OFFSET);

        switch (ch)
        {
        case 0:
            _channels[ch]._dier_CCxIE = TIM_DIER_CC1IE;
            _channels[ch]._dier_CCxDE = TIM_DIER_CC1DE;
            _channels[ch]._sr_CCxIF = TIM_SR_CC1IF;
            _channels[ch]._sr_CCxOF = TIM_SR_CC1OF;
            _channels[ch]._egr_CCxG = TIM_EGR_CC1G;
            _channels[ch]._ccer_CCxE = TIM_CCER_CC1E;
            _channels[ch]._ccer_CCxP = TIM_CCER_CC1P;
            _channels[ch]._ccr = (volatile uint32_t*)(timx_base_addr + TIM_CCR1_OFFSET);
            break;
        case 1:
            _channels[ch]._dier_CCxIE = TIM_DIER_CC2IE;
            _channels[ch]._dier_CCxDE = TIM_DIER_CC2DE;
            _channels[ch]._sr_CCxIF = TIM_SR_CC2IF;
            _channels[ch]._sr_CCxOF = TIM_SR_CC2OF;
            _channels[ch]._egr_CCxG = TIM_EGR_CC2G;
            _channels[ch]._ccer_CCxE = TIM_CCER_CC2E;
            _channels[ch]._ccer_CCxP = TIM_CCER_CC2P;
            _channels[ch]._ccr = (volatile uint32_t*)(timx_base_addr + TIM_CCR2_OFFSET);
            break;
        case 2:
            _channels[ch]._dier_CCxIE = TIM_DIER_CC3IE;
            _channels[ch]._dier_CCxDE = TIM_DIER_CC3DE;
            _channels[ch]._sr_CCxIF = TIM_SR_CC3IF;
            _channels[ch]._sr_CCxOF = TIM_SR_CC3OF;
            _channels[ch]._egr_CCxG = TIM_EGR_CC3G;
            _channels[ch]._ccer_CCxE = TIM_CCER_CC3E;
            _channels[ch]._ccer_CCxP = TIM_CCER_CC3P;
            _channels[ch]._ccr = (volatile uint32_t*)(timx_base_addr + TIM_CCR3_OFFSET);
            break;
        case 3:
            _channels[ch]._dier_CCxIE = TIM_DIER_CC3IE;
            _channels[ch]._dier_CCxDE = TIM_DIER_CC3DE;
            _channels[ch]._sr_CCxIF = TIM_SR_CC4IF;
            _channels[ch]._sr_CCxOF = TIM_SR_CC4OF;
            _channels[ch]._egr_CCxG = TIM_EGR_CC4G;
            _channels[ch]._ccer_CCxE = TIM_CCER_CC4E;
            _channels[ch]._ccer_CCxP = TIM_CCER_CC4P;
            _channels[ch]._ccr = (volatile uint32_t*)(timx_base_addr + TIM_CCR4_OFFSET);
            break;

