gitarmpit/libarmpit/lib/stm32_common/timer.cpp
        };

    }
}

TIMER_Channel*  TIMER_With_Channels::GetChannel(int channelNo)
{
    if (channelNo>0 && channelNo <= _nchannels)
    {
        return &_channels[channelNo-1];
    }
    else
        return 0;
}

AdvancedTimer::AdvancedTimer(uint32_t timx_base_addr, IRQn_Type updateIrqNo, IRQn_Type ccIrqNo,
    volatile uint32_t* rccEnableReg, volatile uint32_t* rccResetReg, uint32_t rccBit):
TIMER_With_SlaveMode(timx_base_addr, 4, updateIrqNo, rccEnableReg, rccResetReg, rccBit,  false),
TIMER_With_DMAControl(timx_base_addr),
TIMER_With_OnePulseMode(timx_base_addr),
TIMER_With_UpDownCounter(timx_base_addr),
TIMER_With_MMS(timx_base_addr),
TIMER_With_BDTR_RCR(timx_base_addr)
{
    _ccIrqNo = ccIrqNo;
    for (uint8_t ch = 0; ch < 4; ++ch)
    {
        _channels[ch]._bdtr = (volatile uint32_t*)(timx_base_addr + TIM_BDTR_OFFSET);
    }
}



void TIMER::EnableCounter (bool enable)
{
    if (enable)
        *_cr1 |= TIM_CR1_CEN;
    else
        *_cr1 &= ~TIM_CR1_CEN;

}


void TIMER::EnableUpdateEvent (bool enable)
{
    if (enable)
        *_cr1 |= TIM_CR1_UDIS;
    else
        *_cr1 &= ~TIM_CR1_UDIS;
}

void TIMER::SetUpdateRequestSource (bool isAny)
{
    if (isAny)
        *_cr1 &= ~TIM_CR1_URS;
    else
        *_cr1 |= TIM_CR1_URS;
}

void TIMER::EnableAutoPreload (bool enable)
{
    if (enable)
        *_cr1 |= TIM_CR1_ARPE;
    else
        *_cr1 &= ~TIM_CR1_ARPE;

}

void TIMER::SetClockDivision_TCK()
{
    *_cr1 &= ~TIM_CR1_CKD_CLEARMASK;
    *_cr1 |= TIM_CR1_CKD_CKINT;
}
void TIMER::SetClockDivision_TCKx2()
{
    *_cr1 &= ~TIM_CR1_CKD_CLEARMASK;
    *_cr1 |= TIM_CR1_CKD_CKINT2;
}
void TIMER::SetClockDivision_TCKx4()
{
    *_cr1 &= ~TIM_CR1_CKD_CLEARMASK;
    *_cr1 |= TIM_CR1_CKD_CKINT4;
}

void TIMER::EnableUpdateInterrupt (bool enable)
{
    if (enable)
    {
        *_dier |= TIM_DIER_UIE;
    }
    else
        *_dier &= ~TIM_DIER_UIE;

}
void TIMER::EnableNVICInterrupt(bool enable)
{
    if (enable)
        NVIC_SetEnable(_globalInterrupt);
    else
        NVIC_ClearEnable(_globalInterrupt);
}

void TIMER::EnableTriggerInterrupt (bool enable)
{
    if (enable)
        *_dier |= TIM_DIER_TIE;
    else
        *_dier &= ~TIM_DIER_TIE;

}

void TIMER::AddInterruptHandler (TIMER_Interrupt_Handler* handler)
{
    if (_irqHandlerCount < MAX_UPDATE_HANDLERS)
        _irqHandlers[_irqHandlerCount++] = handler;
}

void TIMER::SetInterruptHandler (TIMER_Interrupt_Handler* handler)
{
    _irqHandlers[0] = handler;
    if (_irqHandlerCount == 0)
    {
        _irqHandlerCount = 1;
    }
}

void TIMER::SetCounterValue (uint32_t val)
{
    *_cnt = (_is32_bit) ? val : (val & 0xffff);
}

void TIMER::SetPrescalerValue (uint16_t val)
{
    *_psc = val;
}

void TIMER::SetAutoReloadValue (uint32_t val)
{
    *_arr = (_is32_bit) ? val : (val & 0xffff);
}

uint32_t TIMER::GetCounterValue()
{
    return *_cnt;
}

uint32_t TIMER::GetPrescalerValue()
{
    return *_psc;
}

uint32_t TIMER::GetAutoReloadValue()
{
    return *_arr;
}



bool TIMER::IsUIF()
{
    return *_sr & TIM_SR_UIF;
}

void TIMER::ClearUIF()
{
    *_sr &= ~TIM_SR_UIF;
}

bool TIMER_With_Channels::IsTIF()
{
    return *_sr & TIM_SR_TIF;
}

void TIMER_With_Channels::ClearTIF()
{
    *_sr &= ~TIM_SR_TIF;
}

void TIMER::GenerateRegisterUpdate(bool enable)
{
    if (enable)
        *_egr |= TIM_EGR_UG;
    else
        *_egr &= ~TIM_EGR_UG;

}



void TIMER::CalculateTimerValues (uint32_t us, uint32_t* count, uint16_t* presc)
{
    uint32_t timClk = RCC_GetTIMx_CLK(_isAPB1);
    uint64_t count64 = (uint64_t)timClk  * (uint64_t)us / 1000000llu;

    uint32_t max = (_is32_bit) ? 0xffffffff : 0xffff;

    if (count64 == 0)
    {
        count64 = 1;
    }

    *presc = 1;

    while (count64 >= max)
    {
        count64 /= 2;
        (*presc) *= 2;
    }

    *count = (uint32_t)count64;

}

void TIMER::CalculateTimerValues_ns (uint32_t ns, uint32_t* count, uint16_t* presc)
{
    uint32_t timClk = RCC_GetTIMx_CLK(_isAPB1);
    uint64_t count64 = (uint64_t)timClk  * (uint64_t)ns / 1000000000llu;

    uint32_t max = (_is32_bit) ? 0xffffffff : 0xffff;

    if (count64 == 0)
    {
        count64 = 1;
    }

    *presc = 1;

    while (count64 >= max)
    {
        count64 /= 2;
        (*presc) *= 2;
    }

    *count = (uint32_t)count64;

}


uint32_t TIMER::GetTimerClockFreq()
{
    return RCC_GetTIMx_CLK(_isAPB1);
}


void TIMER::CalculateTimerValues2 (uint32_t us, uint16_t* count, uint16_t* presc)
{
    uint32_t timClk = RCC_GetTIMx_CLK(_isAPB1);
//    uint32_t count32 = (uint32_t)((float) timClk / 1000000.f * (float)us);
    uint64_t count32 = (uint64_t)timClk  * (uint64_t)us / 1000000llu;

    uint32_t max = (_is32_bit) ? 0xffffffff : 0xffff;

    if (count32 == 0)
    {
        count32 = 1;
    }

    *presc = 1;

    while (count32 >= max)
    {
        count32 /= 2;
        (*presc) *= 2;
    }

    *count = (uint16_t)count32;

}



void TIMER::SetUpdatePeriod_us (uint32_t us)
{
    uint32_t count;
    uint16_t presc;

    CalculateTimerValues (us, &count, &presc);

    SetAutoReloadValue(count);
    SetPrescalerValue(presc-1);
}

void TIMER::SetUpdatePeriod_ns (uint32_t ns)
{
    uint32_t count;
    uint16_t presc;

    CalculateTimerValues_ns (ns, &count, &presc);

    SetAutoReloadValue(count);
    SetPrescalerValue(presc-1);
}



bool TIMER_With_Channels::IsCenterAlignedModeEnabled()
{
    return (*_cr1 & TIM_CR1_CMS_CLEARMASK);
}

void TIMER_Channel::SetupPWM1(uint32_t period_us, uint32_t duty_us)
{
    SetupPWM (period_us, duty_us, true);
}
void TIMER_Channel::SetupPWM2(uint32_t period_us, uint32_t duty_us)
{
    SetupPWM (period_us, duty_us, false);
}



void TIMER_Channel::UpdatePWMDuty(uint32_t duty_us) 
{
    if (_timer->IsCenterAlignedModeEnabled())
    {
        duty_us /= 2;
    }

    uint16_t duty_count = (uint64_t)duty_us * (uint64_t)_timer->GetTimerClockFreq() / 1000000ull /
                          (uint64_t)(_timer->GetPrescalerValue() + 1); 

    SetCCR((uint16_t)duty_count);
}

void TIMER_Channel::UpdatePWM(uint32_t period_us, uint32_t duty_us)
{
    uint16_t period_count;
    uint16_t presc = 1;

    _timer->CalculateTimerValues2 (period_us, &period_count, &presc);


    uint16_t duty_count = (uint16_t)((float)period_count * ((float)duty_us / (float)period_us));
    _timer->SetAutoReloadValue(period_count);
    _timer->SetPrescalerValue(presc-1);
    SetCCR(duty_count);
}

void TIMER_Channel::SetupPWM(uint32_t period_us, uint32_t duty_us, bool isPWM1)
{
    uint16_t period_count;
    uint16_t presc = 1;

    if (_timer->IsCenterAlignedModeEnabled())
    {
        period_us /= 2;
    }

    _timer->CalculateTimerValues2 (period_us, &period_count, &presc);

    uint16_t duty_count = (uint16_t)((float)period_count * ((float)duty_us / (float)period_us));
    _timer->SetAutoReloadValue(period_count);
    _timer->SetPrescalerValue(presc-1);

    if (isPWM1)
    {
        SetOCMode_PWM1();
    }
    else
    {
        SetOCMode_PWM2();
    }

    if (_bdtr != 0)
    {
        *_bdtr |= TIM_BDTR_MOE;
    }


