gitarmpit/libarmpit/lib/stm32_common/timer.cpp
    SetCCR(duty_count);
    EnableOCPreload(true);
    _timer->EnableAutoPreload(true);
    _timer->GenerateRegisterUpdate(true);
}

//void TIMER_Channel::CaptureInputPWM (uint32_t max_period_us, PWM_Capture_Handler* handler)
//{
//    uint32_t period_count;
//    uint16_t presc = 1;
//
////#ifdef __GNUC__
////    TIMER_With_SlaveMode* twsm =  (TIMER_With_SlaveMode*)(_timer);
////#else
//    TIMER_With_SlaveMode* twsm =  dynamic_cast<TIMER_With_SlaveMode*>(_timer);
////#endif
//    if (twsm == 0)
//    {
//        return;
//    }
//    if (_channelNo != 1)
//    {
//        return;
//    }
//
//    _pwmCaptureHandler = handler;
//
//    _timer->CalculateTimerValues (max_period_us, &period_count, &presc);
//    _timer->SetPrescalerValue(presc-1);
//    _timer->SetCounterValue(0);
//
//    _pwmCaptureHandler = handler;
//    SetModeInputDirect();
//    SetOCCPolarityLow(false);
//    EnableCCInterrupt(true);
//
//    TIMER_Channel* ch2 = _timer->GetChannel(2);
//    ch2->SetModeInputInverse();
//    ch2->SetOCCPolarityLow(true);
//
//    twsm->SetSlaveModeTrigger_TI1FP1();
//    twsm->SetSlaveMode_Reset();
//
//    *_ccer |= (TIM_CCER_CC1E | TIM_CCER_CC2E);
//
//    _timer->EnableNVICInterrupt(true);
//    _timer->EnableCounter(true);
//
//}

void TIMER_With_SlaveMode::CaptureInputPWM (uint32_t max_period_us, PWM_Capture_Handler* handler)
{
    uint32_t period_count;
    uint16_t presc = 1;

    _pwmCaptureHandler = handler;

    CalculateTimerValues (max_period_us, &period_count, &presc);
    SetPrescalerValue(presc-1);
    SetCounterValue(0);
    
    _pwmCaptureHandler = handler;

    TIMER_Channel* ch1 = GetChannel(1);

    ch1->SetModeInputDirect();
    ch1->SetOCCPolarityLow(false);
    ch1->EnableCCInterrupt(true);

    TIMER_Channel* ch2 = GetChannel(2);
    ch2->SetModeInputInverse();
    ch2->SetOCCPolarityLow(true);

    SetSlaveModeTrigger_TI1FP1();
    SetSlaveMode_Reset();

    *(ch1->_ccer) |= (TIM_CCER_CC1E | TIM_CCER_CC2E);

    EnableNVICInterrupt(true);
    EnableCounter(true);

}

